# ImportIGES

## Description
Import a 3D IGES file. (Initial Graphics Exchange Specification)

```pascal
FUNCTION ImportIGES(fileName : STRING): BOOLEAN;
```

```python
def vs.ImportIGES(fileName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fileName|STRING|full path to the file for import|

## See Also
VS Functions:
ExportIGES

## Version
Availability: from Vectorworks 2014

## Category
* File I@O